// Выведите на экран таблицу умножения (как в школьной тетради).
//
//for (var i = 1; i <= 10; i++){
//
//for(var t = 1; t<=10; t++){
//
//document.write(i + ' x ' + t + ' = ' + (i*t) + '<br>');
//
//}
//document.write('<br>');
//}
//Пирамидки
// С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную str. Показать решение.
//
//var str ='';
//for (var i = 1; i<10; i++){
//
//str += i;
//
//}
// С помощью цикла for сформируйте строку '987654321' и запишите ее в переменную str. Показать решение.
//
//var str ='';
//for (var i = 9; i>0; i--){
//
//str += i;
//
//}
// С помощью цикла for сформируйте строку '-1-2-3-4-5-6-7-8-9-' и запишите ее в переменную str. Показать решение.
//
//var str = '-';
//for (var i = 1; i < 10; i++){
//
//str +=i+'-';
//
//}
// Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:
//
//x
//xx
//xxx
//xxxx
//xxxxx
//Показать решение.
//

//var x = '';
//
//for (var i = 0; i < 20; i++ ){
//x += 'x';
//document.write(x+"<br>");
//
//}
// С помощью двух вложенных циклов нарисуйте следующую пирамидку:
//
//1
//22
//333
//4444
//55555
//666666
//7777777
//88888888
//999999999
//Показать решение.
//
//for (var i = 1; i < 10; i++){
//
//var str = '';
//
//for (var t = 0; t < i; t++){
//document.write(i);
//
//}
//document.write('<br>');
//}
// Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for:
//
//xx
//xxxx
//xxxxxx
//xxxxxxxx
//xxxxxxxxxx

//var x = '';
//
//for (var i = 0; i < 5; i++ ){
//x += 'xx';
//document.write(x+"<br>");
//
//}

